# IsTwoSided Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Face..::..IsTwoSided Property
Face Class See Also
---
Determines if a face is two-sided (degenerate).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool IsTwoSided { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property IsTwoSided As Boolean
	Get
```

Visual C++
---
```text
public:
virtual property bool IsTwoSided {
	bool get ();
}
```

# See Also
Face Class
Autodesk.Revit.DB Namespace